Show / Hide Table of Contents
Class ApplyConnTemplateSetting
Defaults which are used for applying template
Inheritance
System.Object
ApplyConnTemplateSetting
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[DataContract]
public class ApplyConnTemplateSetting
Properties
Improve this Doc   View Source
DefaultBoltAssemblyID
ID of the bolt assembly which will be used as default (it must exists in the project)
Declaration
[DataMember]
public int DefaultBoltAssemblyID { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
DefaultCleatCrossSectionID
ID of the cross section for cleats which will be used as default (it must exists in the project)
Declaration
[DataMember]
public int DefaultCleatCrossSectionID { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
DefaultConcreteMaterialID
ID of the material concrete which will be used as default (it must exists in the project)
Declaration
[DataMember]
public int DefaultConcreteMaterialID { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
DefaultStiffMemberCrossSectionID
ID of the cross-section for stiffening members concrete which will be used as default (it must exists in the project)
Declaration
[DataMember]
public int DefaultStiffMemberCrossSectionID { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source